RhinoInside.Revit API Documentation
GeometryDecoder.ToPlane Method
 Converts the specified Plane to an equivalent Rhino Plane.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8021
Syntax
public static Rhino.Geometry.Plane ToPlane(
	this Autodesk.Revit.DB.Plane value
)
@staticmethod
def ToPlane(
	value: Autodesk.Revit.DB.Plane
) -> Rhino.Geometry.Plane
Parameters
value
Type: Autodesk.Revit.DB.Plane
A value to convert.
Return Value
Type: Rhino.Geometry.Plane
A Rhino Plane that is equivalent to the provided value.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Autodesk.Revit.DB.Plane. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
See Also
Reference
GeometryDecoder Class
RhinoInside.Revit.Convert.Geometry Namespace